package com.smates.dbc2.consts;

/**
 * 系统用到的全局静态变量
 * 
 * @author baijw
 *
 */
public class Consts {

	// GIS中用的县区名称
	public static String[] countryNames = {"阿拉善右旗","肃北蒙古族自治县","玉门市","天峻县", "高台县", "山丹县", "额济纳旗", "永昌县", "市辖区", "民乐县", "金塔县", "甘肃中牧山丹马场","甘州区","肃州区","金川区","临泽县","祁连县","肃南裕固族自治县" };

	//25个指标
	public static String[] indexs = {"水生产力","水压力","生态蓄水量","地下水开采量","生态用水量","集成水资源管理执行度","跨边界流域可操作合约有效性","农业水生产力","农业水利用效率","每公顷农产品产值","种植面积","湿地面积","森林覆盖率","可持续森林管理覆盖","山地绿色覆盖指数","人均GDP","就业人口人均GDP增长率","年轻人就业率","年轻人失业率","安全饮用水人口比例","旅游业产值在GDP中的比例","旅游消费","土地消耗率与人口增长率的比率","城镇化率","可持续社会福利指数"};
	
	//GIS右下角图标的阈值【除数】
	public static double[] development = {16,0.7,5.6,23,6,500,103,71,27};
}
